Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
/* 
 * File:   sensepi_cam_trigger.c
 * Copyright (c) 2018 Appiko
 * Created on 1 June, 2018, 3:30 PM
 * Author: Tejas Vasekar (https://github.com/tejas-tj)
 * All rights reserved.
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE
 */

#include "sensepi_cam_trigger.h"

#include "sensepi_ble.h"

#include "pir_sense.h"
#include "led_sense.h"
#include "log.h"
#include "device_tick.h"
#include "mcp4012_x.h"
#include "ms_timer.h"
#include "out_pattern_gen.h"

#include "boards.h"

#include "hal_pin_analog_input.h"
#include "hal_nop_delay.h"
#include "hal_gpio.h"
#include "nrf_util.h"
#include "common_util.h"

#include "stdint.h"
#include "stdbool.h"
#include "string.h"

/*Make this 1 while doing debugging over UART*/
#define DEBUG_PRINT 1

/*Sensepi_PIR module MACROS*/
#define LED_WAIT_TIME_MS 301
#define PIR_SENSE_INTERVAL_MS 50
#define PIR_SENSE_THRESHOLD 600
#define PIR_THRESHOLD_MULTIPLY_FACTOR 8
#define LIGHT_THRESHOLD_MULTIPLY_FACTOR 32
#define SENSEPI_PIR_SLOW_TICK_INTERVAL_MS 300000

/*Data_Process module MACROS*/
//#define PIR_DATA_PROCESS_MODE false

//#define TIMER_DATA_PROCESS_MODE true

#define SIZE_OF_BYTE 8
#define POS_OF_MODE 0
#define POS_OF_INPUT1 1
#define POS_OF_INPUT2 3
#define MODE_MSK 0x000000FF
#define INPUT1_MSK 0x00FFFF00
#define INPUT2_MSK 0xFF000000

//#define MODE_SINGLE_SHOT    0x00
//#define MODE_MULTISHOT      0x01
//#define MODE_BULB           0x02
//#define MODE_VIDEO          0x03
//#define MODE_FOCUS          0x04

#define NUM_PIN_OUT 2
#define FOCUS_TRIGGER_TIME_DIFF LFCLK_TICKS_977(20)
#define SINGLE_SHOT_TRANSITIONS 2
#define SINGLE_SHOT_DURATION LFCLK_TICKS_977(250)
#define BULB_TRIGGER_PULSE LFCLK_TICKS_977(150)
#define VIDEO_TRANSITION 3
#define VIDEO_CONTROL_PULSE LFCLK_TICKS_977(200)
#define FOCUS_TRANSITIONS 3


/*SensePi_PIR module variables.*/
static sensepi_cam_trigger_init_config_t config;
static pir_sense_cfg config_pir;
static uint32_t intr_trig_time_in = 0;
static uint32_t timer_interval_in = 0;
static uint32_t working_mode = 0;
static uint32_t video_pir_disable_len = 0;
static bool video_on_flag = false;
static uint32_t video_ext_time = 0;
static bool sensepi_cam_trigger_start_flag = 0;
//static bool timer_done_flag = 0;
sensepi_config_t current_config;

/*Data_Process module variables*/
bool one_click_pattern[NUM_PIN_OUT][OUT_GEN_MAX_TRANSITIONS] = {{1,0},
    {1,0}};
static uint32_t delay_array[OUT_GEN_MAX_TRANSITIONS] = {};
static bool out_pattern[OUT_GEN_MAX_NUM_OUT][OUT_GEN_MAX_TRANSITIONS] = {};
static uint32_t number_of_transition = 0;
static uint32_t config_mode;
static uint32_t time_remain = 0;
static uint32_t total_delay = 0;
static uint32_t video_current_time = 0;
static bool out_gen_end_all_on[OUT_GEN_MAX_NUM_OUT] = {1,1,1,1};

typedef enum 
{
    PIR_DATA_PROCESS_MODE,
    TIMER_DATA_PROCESS_MODE,
}
data_process_mode_t;

typedef enum 
{
    MODE_SINGLE_SHOT,
    MODE_MULTISHOT,
    MODE_BULB,
    MODE_VIDEO,
    MODE_FOCUS,
            
} 
operational_mode_t;

typedef enum
{
    IDLE,
    PHOTO,
    VIDEO_START,
    VIDEO_EXT,
    VIDEO_END,
    VIDEO_TIMER,
} cam_trig_state_t;

/**
 * @brief Function to enable PIR sensing
 */
void pir_enable();

/**
 * @brief Function to disable PIR sensing
 */
void pir_disable();

/**IRQ Handler for PIR interrupt*/
void pir_handler(int32_t adc_val);

void timer_handler(void);

/**
 * @brief Function to enable LED sensing with proper parameters.
 * @param led_conf Configuration which is to be used to activate LED light 
 * sensing
 */
void led_sense_conf(sensepi_cam_trigger_init_config_t * led_conf);

/**
 * @brief Function to check light conditions and comapre light conditions with 
 * configuration provided by user.
 * @param oper_time_temp Local copy of oper_time to select light condition
 * configuration
 * @return if light conditions satisfies the conditions provided by config
 * return 1, else retunr 0.
 */
bool light_check(oper_time_t oper_time_temp);

/**
 * @brief Function to Check if operational mode is Video. And if yes check if
 * PIR is needed to switch on yet or not.
 * @param interval Interval since last tick
 * @return 1 if:\
 * operational mode is not video or specified time has passed.
 * @return 0 if:\
 * operational mode is video and specified time has not passed. 
 */
bool check_video_len(uint32_t interval);

/*Data_Process module functions*/
    
/**
 * @brief Function which is to be called to generate and send output pattern
 * @param data_process_mode boolean value to select from which configuration
 * mode has to be selected
 */
void data_process_pattern_gen(bool data_process_mode);
/**
 * @brief Function to store configuration received from mobile app.
 * @param config Configuration for which local copy has to be created.
 */
void data_process_config(sensepi_config_t *local_config, uint32_t * out_pin_array);

/**
 * @brief Function which is to be called when Sensepi_PIR module is being \
 * terminated
 */
void data_process_stop();

/**
 * @brief Function to add extention to video
 * @param time_remaining How much time is remaining out of original video len.
 * @note This function will come in play only when PIR is being used and mode of
 * operation is video mode.
 */
void data_process_add_video_ext(uint32_t time_remaining);
/**
 * @brief Function to get Extention value.
 * @return Extention time
 */
uint32_t data_process_get_video_extention(void);

/**
 * @brief Functions to generate patterns according to selected camera trigger
 * mode.
 */
void single_shot_mode();
void multi_shot_mode(uint32_t input1, uint32_t input2);
void bulb_mode(uint32_t input1, uint32_t input2);
void video_mode(uint32_t input1, uint32_t input2);
void focus_mode();

/**
 * @brief Handler for out pattern generation done.
 * @param out_gen_state State from which handler is called.
 */
void pattern_out_done_handler(uint32_t out_gen_state);

///Function definations
/*SensePi_PIR module*/
void pir_enable()
{
    log_printf("PIR_Enabled\n");
    pir_sense_start(&config_pir);
}

void pir_disable()
{
    log_printf("PIR_Disabled\n");
    pir_sense_stop();
}

void pir_handler(int32_t adc_val)
{
    log_printf("Sensed %d\n", adc_val);
    pir_disable();
    if(video_on_flag == true && time_remain > 0)
    {

        video_current_time = out_gen_get_ticks();
        time_remain -= (video_current_time);            
        out_gen_stop(out_gen_end_all_on);
        out_gen_config_t video_end_out_gen_config = 
        {
            .num_transitions = 1,
            .out_gen_done_handler = pattern_out_done_handler,
            .out_gen_state = VIDEO_EXT,
            .transitions_durations = {video_ext_time,
            LFCLK_TICKS_977(10)},
            .next_out =  {{1,1,1},
            {1,1,1}},
            
