Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
        };
        out_gen_start(&video_end_out_gen_config);
#if DEBUG_PRINT
            log_printf("Out Pattern PIR Handler:\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_pattern[0]); arr_p++)
                {
                    log_printf("%x ", video_end_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
    }
    else
    {
        data_process_pattern_gen(PIR_DATA_PROCESS_MODE);        
    }
}

void timer_handler(void)
{
    log_printf("Timer Handler\n");
    data_process_pattern_gen(TIMER_DATA_PROCESS_MODE);
    //TODO Make it repeated to start off initially
//    ms_timer_start(MS_TIMER2,
//        MS_SINGLE_CALL,
//        LFCLK_TICKS_977(config.config_sensepi->timer_conf.timer_interval),
//        timer_handler);

}

void led_sense_conf(sensepi_cam_trigger_init_config_t * led_conf)
{
    log_printf("Led_Sense_Conf\n");
    led_sense_init(led_conf->led_sense_out_pin,
            led_conf->led_sense_analog_in_pin,
            led_conf->led_sense_off_val);
}

bool light_check(oper_time_t oper_time_temp)
{
//    log_printf("Light check\n");
    log_printf("Light intensity : %d\n", led_sense_get());
    static uint8_t light_sense_config = 1;
    static uint32_t light_threshold = 0;
    static bool light_check_flag = 0;
    light_sense_config = oper_time_temp.day_or_night;
    light_threshold = (uint32_t)((oper_time_temp.threshold) * LIGHT_THRESHOLD_MULTIPLY_FACTOR);
    if(light_sense_config == 1 && led_sense_get() >= light_threshold)
    {
        light_check_flag = 1;
    }
    else if(light_sense_config == 0 && led_sense_get() <= light_threshold)
    {
        light_check_flag = 1;
    }
    else
    {
        light_check_flag = 0;
    }
    return light_check_flag;

}

void sensepi_cam_trigger_start()
{
    led_sense_cfg_input(true);
    hal_nop_delay_ms(LED_WAIT_TIME_MS);
    //This if will check if module is already working or not.
    if(sensepi_cam_trigger_start_flag == 0)
    {
        log_printf("SensePi_PIR_Start\n");
        if(false == (config.config_sensepi->trig_conf == PIR_ONLY))
        {
            log_printf("\n\nTimer ON\n\n");
            ms_timer_start(MS_TIMER2,
                MS_REPEATED_CALL, LFCLK_TICKS_977(timer_interval_in), timer_handler);
        }
        if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
        {
            log_printf("\n\nPIR ON\n\n");
            pir_enable();
        }
        sensepi_cam_trigger_start_flag = 1;
    }
    return;
}

void sensepi_cam_trigger_stop()
{
    log_printf("SensePi_PIR_Stop\n");
    led_sense_cfg_input(false);
    pir_disable();
    ms_timer_stop(MS_TIMER2);
    out_gen_stop(out_gen_end_all_on);
    sensepi_cam_trigger_start_flag = 0;
    return;

}

void sensepi_cam_trigger_init(sensepi_cam_trigger_init_config_t * config_sensepi_cam_trigger)
{
    log_printf("SensePi_PIR_init\n");
    memcpy(&config, config_sensepi_cam_trigger, sizeof(config));
    sensepi_config_t local_sensepi_config_t;
    memcpy(&local_sensepi_config_t, config.config_sensepi,sizeof(local_sensepi_config_t));
    working_mode = local_sensepi_config_t.trig_conf;
    switch(working_mode)
    {
        case PIR_ONLY:
        {
            pir_sense_cfg local_config_pir = 
            {
                PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
                config.pir_sense_offset_input,
                ((uint32_t)local_sensepi_config_t.pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
                APP_IRQ_PRIORITY_HIGH, pir_handler, 
            };
            config_pir = local_config_pir;
            intr_trig_time_in = (local_sensepi_config_t.pir_conf.intr_trig_timer)*100;
            led_sense_conf(&config);
            mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
            mcp4012_set_value(config_sensepi_cam_trigger->config_sensepi->pir_conf.amplification);
            break;
        }
        case TIMER_ONLY:
        {
            timer_interval_in = (local_sensepi_config_t.timer_conf.timer_interval);
            break;
        }
        case PIR_AND_TIMER:
        {
            pir_sense_cfg local_config_pir = 
            {
                PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
                config.pir_sense_offset_input,
                ((uint32_t)local_sensepi_config_t.pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
                APP_IRQ_PRIORITY_HIGH, pir_handler, 
            };
            config_pir = local_config_pir;
            intr_trig_time_in = (local_sensepi_config_t.pir_conf.intr_trig_timer)*100;
            led_sense_conf(&config);
            mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
            mcp4012_set_value(config_sensepi_cam_trigger->config_sensepi->pir_conf.amplification);
            timer_interval_in = (local_sensepi_config_t.timer_conf.timer_interval);
            break;
        }
    }
        data_process_config(config.config_sensepi, config.signal_out_pin_array);
    return;
}

void sensepi_cam_trigger_update(sensepi_config_t * update_config)
{
    log_printf("SensePi_PIR_update\n");
    memcpy(config.config_sensepi, update_config, sizeof(sensepi_config_t));
    working_mode = config.config_sensepi->trig_conf;
    switch((trigger_conf_t)working_mode)
    {
        case PIR_ONLY:
        {
            config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
                    *PIR_THRESHOLD_MULTIPLY_FACTOR;
            mcp4012_set_value(config.config_sensepi->pir_conf.amplification);
            intr_trig_time_in = ((uint32_t)config.config_sensepi->pir_conf.intr_trig_timer)*100;
            break;
        }
        case TIMER_ONLY:
        {
            timer_interval_in = (config.config_sensepi->timer_conf.timer_interval);
            break;
        }
        case PIR_AND_TIMER:
        {
            config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
                    *PIR_THRESHOLD_MULTIPLY_FACTOR;
            mcp4012_set_value(config.config_sensepi->pir_conf.amplification);
            intr_trig_time_in = ((uint32_t)config.config_sensepi->pir_conf.intr_trig_timer)*100;
            timer_interval_in = (config.config_sensepi->timer_conf.timer_interval);
            break;
        }
    }
    data_process_config(config.config_sensepi, config.signal_out_pin_array);
}

void sensepi_cam_trigger_add_tick(uint32_t interval)
{
    log_printf("SensePi Add ticks : %d\n", interval);
    //TODO Take care of this if
    //NOTE if this if() removed then state switching does not happen
    if(interval > 51)
    {
        working_mode = config.config_sensepi->trig_conf;
        switch(working_mode)
        {
            case PIR_ONLY:
            {
                if(light_check(config.config_sensepi->pir_conf.oper_time))
                {
                    sensepi_cam_trigger_start();
                }
                else
                {
                    sensepi_cam_trigger_stop();
                }
                break;
            }
            case TIMER_ONLY:
            {
                if(light_check(config.config_sensepi->timer_conf.oper_time) == true)
                {
                    sensepi_cam_trigger_start();
                }
                else
                {
                    sensepi_cam_trigger_stop();
                }
                break;
            }
            //TODO make an internal config for the oper time
            case PIR_AND_TIMER:
            {
                if(light_check(config.config_sensepi->pir_conf.oper_time) || 
                light_check(config.config_sensepi->timer_conf.oper_time) == true)
                {
                    sensepi_cam_trigger_start();
                }
                else
                {
                    sensepi_cam_trigger_stop();
                }
                break;
            }

