Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
        }
    }
}

/*Data_Process module*/

void pattern_out_done_handler(uint32_t out_gen_state)
{
    log_printf("OUT_GEN_STATE : %02x\n", out_gen_state);

    switch((cam_trig_state_t)out_gen_state)
    {
        case IDLE:
        {
            if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
            {
                pir_enable();            
            }
//            out_gen_stop(out_gen_end_all_on);
            break;
        }
        case PHOTO:
        {
            out_gen_config_t idle_out_gen_config =
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = IDLE,
                .transitions_durations = {LFCLK_TICKS_977(10), time_remain},
                .next_out = {{1,1,1},
                {1,1,1}},
            };

#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0;
                        arr_p<ARRAY_SIZE(idle_out_gen_config.next_out[0]); arr_p++)
                {
                    log_printf("%x ", idle_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            out_gen_start(&idle_out_gen_config);
            break;
        }
        case VIDEO_START:
        {
            video_on_flag = true;
            pir_enable();
            out_gen_config_t video_end_out_gen_config = 
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = VIDEO_END,
                .transitions_durations =
                    {time_remain, VIDEO_CONTROL_PULSE,VIDEO_CONTROL_PULSE,
                    LFCLK_TICKS_977(10)},
                .next_out = 
                    {{1,0,1,1},
            {1,1,1,1}},
            };
            uint32_t local_delay[OUT_GEN_MAX_TRANSITIONS] ;
            bool out_pattern[OUT_GEN_MAX_NUM_OUT][OUT_GEN_MAX_TRANSITIONS] ;

            memcpy((video_end_out_gen_config.transitions_durations), 
                    local_delay, sizeof(local_delay));
            memcpy((video_end_out_gen_config.next_out), out_pattern, sizeof(out_pattern));
            out_gen_start(&video_end_out_gen_config);
#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_pattern[0]); arr_p++)
                {
                    log_printf("%x ", video_end_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            break;
        }
        case VIDEO_EXT:
        {
            time_remain += video_ext_time;

            out_gen_config_t video_end_out_gen_config = 
            {
                .num_transitions = 3,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = VIDEO_END,
                .transitions_durations = {time_remain,
                    LFCLK_TICKS_977(10), VIDEO_CONTROL_PULSE},
                .next_out = 
                    {{1,1,0,1},
                    {1,1,1,1}},
            };
            out_gen_start(&video_end_out_gen_config);
            pir_enable();
#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_pattern[0]); arr_p++)
                {
                    log_printf("%x ", video_end_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            break;
        }
        case VIDEO_END:
        {
            video_on_flag = 0;
            pir_enable();
            break;
        }
        case VIDEO_TIMER:
        {
            break;
        }
    }
    return;
}

sensepi_config_t * sensepi_cam_trigger_get_sensepi_config_t()
{
    log_printf("SensePi_PIR_get_config\n");
    return (config.config_sensepi);
}

uint32_t data_process_get_video_extention (void)
{
    return (uint32_t)config.config_sensepi->pir_conf.intr_trig_timer;
}

void data_process_config(sensepi_config_t *local_config, uint32_t *out_pin_array )
{
    log_printf("Data_Process_CONF\n");

    out_gen_init(NUM_PIN_OUT, out_pin_array);
    out_gen_stop(out_gen_end_all_on);


}

void single_shot_mode()
{
    log_printf("SINGLE_SHOT_MODE\n");
    number_of_transition = SINGLE_SHOT_TRANSITIONS;
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = PHOTO,
        .transitions_durations = {FOCUS_TRIGGER_TIME_DIFF,
              SINGLE_SHOT_DURATION},
        .next_out =
            {{0, 0, 1},
            {1, 0, 1}},
    };

    total_delay = 0;
    for(uint32_t arr_c = 0; 
            arr_c < ARRAY_SIZE(out_gen_config.transitions_durations); arr_c++)
    {
        total_delay += out_gen_config.transitions_durations[arr_c];
    }
    time_remain = LFCLK_TICKS_977(intr_trig_time_in) - (total_delay);

#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; 
                arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
    log_printf("Time_remain : %d\n", time_remain);
#endif
    out_gen_start(&out_gen_config);  
}

void multi_shot_mode(uint32_t input1, uint32_t input2)
{
    log_printf("MULTISHOT_MODE\n");
    bool one_click_pattern[NUM_PIN_OUT][SINGLE_SHOT_TRANSITIONS] = {{0,1},
    {0,1}};
    number_of_transition = SINGLE_SHOT_TRANSITIONS * input2;
    uint32_t repeat_delay_array[SINGLE_SHOT_TRANSITIONS] =
    {SINGLE_SHOT_DURATION, LFCLK_TICKS_977(input1 * 100)};
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = PHOTO,
        .transitions_durations[0] = FOCUS_TRIGGER_TIME_DIFF,
        .next_out[0][0] = 1,
        .next_out[1][0] = 1,
    };
    for(uint32_t loop = 1; loop <= number_of_transition; loop = loop+SINGLE_SHOT_TRANSITIONS)
    {
        memcpy(&out_gen_config.transitions_durations[loop], 
                repeat_delay_array, sizeof(repeat_delay_array));
        memcpy(&(out_gen_config.next_out[0][loop]),
                &one_click_pattern[0][0],SINGLE_SHOT_TRANSITIONS);
        memcpy(&(out_gen_config.next_out[1][loop]),
                &one_click_pattern[1][0],SINGLE_SHOT_TRANSITIONS);

