Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
    }
    total_delay = 0;
    for(uint32_t arr_c = 0;
            arr_c < ARRAY_SIZE(out_gen_config.transitions_durations); arr_c++)
    {
        total_delay += out_gen_config.transitions_durations[arr_c];
    }
    time_remain = LFCLK_TICKS_977(intr_trig_time_in) - (total_delay);

#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
    out_gen_start(&out_gen_config);

}

void bulb_mode(uint32_t input1, uint32_t input2)
{
    log_printf("BULB_MODE\n");
    number_of_transition = SINGLE_SHOT_TRANSITIONS+2;
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = PHOTO,
        .transitions_durations =
            {LFCLK_TICKS_977(1), (LFCLK_TICKS_977((input1+input2)*100) - BULB_TRIGGER_PULSE),
    BULB_TRIGGER_PULSE, LFCLK_TICKS_977(1)},
        .next_out = {
        {1, 0, 0, 1,1},
        {1, 1, 0, 1,1}},
    };
    total_delay = 0;
    for(uint32_t arr_c = 0; 
            arr_c < ARRAY_SIZE(out_gen_config.transitions_durations); arr_c++)
    {
        total_delay += out_gen_config.transitions_durations[arr_c];
    }
    time_remain = LFCLK_TICKS_977(intr_trig_time_in) - (total_delay);

#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
    out_gen_start(&out_gen_config);

}

void video_mode(uint32_t input1, uint32_t input2)
{
    log_printf("VIDEO_MODE\n");
    out_gen_config_t out_gen_config = 
    {
        .out_gen_done_handler = pattern_out_done_handler,
    };
    if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
    {
        out_gen_config.out_gen_state = VIDEO_START;
        video_ext_time = data_process_get_video_extention();
        video_pir_disable_len = LFCLK_TICKS_977((input1 * 100) - video_ext_time);
        number_of_transition = VIDEO_TRANSITION;
        time_remain = LFCLK_TICKS_977(video_ext_time);
        uint32_t local_delay_array[VIDEO_TRANSITION] = 
        {FOCUS_TRIGGER_TIME_DIFF, VIDEO_CONTROL_PULSE,
            (video_pir_disable_len)};
        bool local_out_pattern[NUM_PIN_OUT][VIDEO_TRANSITION + 1] = {
            {1, 0, 1, 1},
            {1, 1, 1, 1}};
        memcpy(delay_array, local_delay_array, sizeof(local_delay_array));
        for(uint32_t row; row < NUM_PIN_OUT; row++)
        { 
            memcpy(&out_pattern[row][0], &local_out_pattern[row][0], (VIDEO_TRANSITION+1));
        }
    }
    else
    {
        time_remain = timer_interval_in - ((input1 * 100) - 500);
        log_printf("time_remain: %d\n",time_remain);
        time_remain = LFCLK_TICKS_977(time_remain);
        number_of_transition = VIDEO_TRANSITION * 2;
        uint32_t local_delay_array[VIDEO_TRANSITION * 2] =
        {FOCUS_TRIGGER_TIME_DIFF, VIDEO_CONTROL_PULSE,
            LFCLK_TICKS_977(input1*100), VIDEO_CONTROL_PULSE,
            FOCUS_TRIGGER_TIME_DIFF, time_remain};
        bool local_out_pattern[NUM_PIN_OUT][(VIDEO_TRANSITION * 2) + 1] = {
            {1, 0, 1, 0, 1, 1},
            {1, 1, 1, 1, 1, 1}};
        memcpy(delay_array, local_delay_array, sizeof(local_delay_array));
        for(uint32_t row; row < NUM_PIN_OUT; row++)
        { 
            memcpy(&out_pattern[row][0], &local_out_pattern[row][0], (number_of_transition+1));
        }
    }
    out_gen_config.num_transitions = number_of_transition;
    memcpy(out_gen_config.transitions_durations, delay_array, sizeof(delay_array));
    memcpy(out_gen_config.next_out, out_pattern, sizeof(out_pattern));
    //TODO check out_gen_state value
    
#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
    
    out_gen_start(&out_gen_config);     
}

void focus_mode()
{
    log_printf("FOCUS_MODE\n");
    number_of_transition = FOCUS_TRANSITIONS;
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = PHOTO,
        .transitions_durations =
        {SINGLE_SHOT_DURATION, SINGLE_SHOT_DURATION , SINGLE_SHOT_DURATION},
        .next_out = {
        {1, 0, 1, 1},
        {1, 1, 1, 1}
    },
        
    };
    
    total_delay = 0;
    for(uint32_t arr_c = 0;
            arr_c < ARRAY_SIZE(out_gen_config.transitions_durations); arr_c++)
    {
        total_delay += out_gen_config.transitions_durations[arr_c];
    }
    time_remain = LFCLK_TICKS_977(intr_trig_time_in)  - (total_delay);
    
#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
    
    out_gen_start(&out_gen_config);

}

void data_process_pattern_gen(bool data_process_mode)
{
    log_printf("Pattern_Generation\n");
    for(uint32_t pin_num = 0;
            pin_num < NUM_PIN_OUT; pin_num++)
    {
        hal_gpio_cfg_output(config.signal_out_pin_array[pin_num], 1);
    }

    if((data_process_mode_t)data_process_mode == PIR_DATA_PROCESS_MODE)
    {
        config_mode = config.config_sensepi->pir_conf.mode;
    }
    else
    {
        config_mode = config.config_sensepi->timer_conf.mode;
    }
    out_gen_stop(out_gen_end_all_on);
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (POS_OF_MODE * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (POS_OF_INPUT1 * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (POS_OF_INPUT2 * SIZE_OF_BYTE));
#if DEBUG_PRINT
    log_printf("Mode : %02x\n", mode);
    log_printf("Input 1 : %06d\n", input1);
    log_printf("input 2 : %02x\n", input2);
#endif
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
//            single_shot
            single_shot_mode();
            break;
        }
        case MODE_MULTISHOT:
        {
            log_printf("MULTISHOT MODE\n");
            multi_shot_mode(input1, input2);
            break;
        }
        case MODE_BULB :
        {
//            bulb(input1, input2)
#if 0
            input1 = 1500;
            input2 = 10;
#endif
            bulb_mode(input1,input2);
            break;
        }
        case MODE_VIDEO :
        {
//            video(input1, input2)
//            input1 = 60;
//            input2 = 10;
            video_mode(input1, input2);
            break;
        }
        case MODE_FOCUS :
        {
            focus_mode();
            break;
        }
#if 0
#endif
    }   
    return;        
}

void data_process_stop()
{
    log_printf("Data Process Stop\n");
    out_gen_stop(out_gen_end_all_on);
}
